---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopEndExceedsOrNotReachWarning
source: html/4ee2a984-d5aa-04a1-5454-a167d9835f2a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopEndExceedsOrNotReachWarning Property

Stair top end exceeds or cannot reach the top elevation of the stair. Add/remove risers at the top end or change top elevation settings in Stair Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsTopEndExceedsOrNotReachWarning { get; }
```